#+title: Bioinfomatics scripts
#+author: Vidyasagar Gopi
#+options: toc:nil

* A collection of my bioinfomatics scripts

#+begin_src sh :results output :exports results
tree -L 3 --noreport
#+end_src

#+RESULTS:
#+begin_example
.
├── conda-activate.sh
├── conda-manager.sh
├── gwas
│   ├── gene_loc_from_name.py
│   ├── gwas-associatons-from-gene-name.sh
│   ├── rsids2pos-allele.py
│   ├── UCSC_gene_info_from_gene_name_file_csv.py
│   └── UCSC_gene_info_from_gene_name_full_info.py
├── install-scripts
│   ├── install-conda.sh
│   ├── install-edirect.sh
│   └── install-nextflow.sh
├── README.org
├── utils
│   ├── csv2sql.py
│   ├── doi-papers
│   │   ├── bioproject2doi.py
│   │   ├── doi2year.py
│   │   ├── dois.tsv
│   │   ├── dois_with_metadata.tsv
│   │   └── get_metadata_from_doi.py
│   ├── extract_pdf_links.py
│   ├── isolate-code-blocks.sh
│   ├── pandas-polars
│   │   ├── pandas-view.py
│   │   ├── polars-check-dups.py
│   │   └── polars-view.py
│   ├── pdf-compression
│   └── xlsx2csv-sep-sheets-to-files.py
└── variant-calling
    └── aggregate_mpile_and_haplotypecaller.sh
#+end_example
